<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d111c59066e7221f82de42d7b66a46feb45b386a50ddca6b940d5803c905c386","plan_job_ref":"Job terraform plan #119 at https://github.com/suzutan/infra/actions/runs/16352018910","plan_out_hash":"c99a65bff20554c2271ca52d0c9d4b96abc4a48499dcfe0ec514555c181c1b29","plan_hash":"6829413d17302f3ec09aeb138c5c7ed3ed2b56ee8a77b81eb8878a4e8f23d75a","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 0 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # cloudflare_dns_record.k8s_ingress["traefik.harvestasya.org"] will be destroyed
  # (because key ["traefik.harvestasya.org"] is not in for_each map)
-   resource "cloudflare_dns_record" "k8s_ingress" {
-       content     = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com" -> null
-       created_on  = "2025-07-12T03:03:17Z" -> null
-       id          = "3a5d312f96a38fcbd87937fca7d54aeb" -> null
-       meta        = jsonencode({})
-       modified_on = "2025-07-12T03:03:17Z" -> null
-       name        = "traefik.harvestasya.org" -> null
-       proxiable   = true -> null
-       proxied     = true -> null
-       settings    = {} -> null
-       tags        = [] -> null
-       ttl         = 1 -> null
-       type        = "CNAME" -> null
-       zone_id     = "98fc606abe946efeabebe1fdbf0af490" -> null
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress      = [
!~              {
-                   hostname       = "traefik.harvestasya.org" -> null
-                   origin_request = {
-                       http_host_header   = "traefik.harvestasya.org" -> null
-                       no_tls_verify      = true -> null
-                       origin_server_name = "traefik.harvestasya.org" -> null
                    } -> null
!~                  service        = "https://traefik.traefik.svc.cluster.local" -> "http_status:404"
                },
-               {
-                   service = "http_status:404" -> null
                },
#                (10 unchanged elements hidden)
            ]
!~          warp_routing = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-07-12T03:03:17Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> (known after apply)
!~      version    = 5 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #119](https://github.com/suzutan/infra/actions/runs/16352018910)